#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Уровень 0
Дано:
y=[2, 8, 0, 4, 1, 9, 9, 0]
Найти:
среднее, медиану, моду, квартили, дисперсию, стандартное отлонение, максимум, минимум,
эксцесс, ассиметрию. Потсроить график. Описать соотношение значений данных характеристик, и их
смысл в целом.
Пронаблюдать как изменятся характреристики, если мы хотим получить переменную z : z=10-2*y
Уровень 1
Посчитать следующие вероятности для распределений:
1)
Случайная величина следует Нормальному Распределению с параметром мю равным 5 и
сигмой в квадрате - 4
Найти вероятность того что данная величина примет значение большее чем 7
2)
Случайная величина следует Распределению Пуассона с параметром лямбда равным 5
Найти вероятность того что данная величина примет значение большее чем 2, но меньшее
чем 10
Уровень Бог.
Определить распредение следующего ряда:
y=[2, 8, 0, 4, 1, 9, 9, 0]
Результаты прокомметнировать !
"""

